package by.academy.homework2;

//Задание 2. Класс Деньги для работы с денежными суммами. 
//Число должно быть представлено двумя полями: 
//типа long для рублей и типа char - для копеек. 
//Дробная часть (копейки) при выводе на экран должна быть отделена от целой части запятой. 
//Реализовать сложение, вычитание, деление сумм, деление суммы на дробное число, 
//умножение на дробное число и операции сравнения. В функции main проверить эти методы.

public class Task2 {

	public static void main(String[] args) {
		

	}

}
